Tekla Open API Reference for Tekla Structures 2025
DetailTypeEnum Enumeration
 The detail type defines what kind of a detail is in question.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DetailTypeEnum
Public Enumeration DetailTypeEnum
Members
Member name | Value | Description
END | 0 |  With the detail type end, the X-axis is oriented towards the part's center point.
INTERMEDIATE | 1 |  With the detail type intermediate, the X-axis is oriented towards the end point of the part.
INTERMEDIATE_REVERSE | 2 |  With the detail type intermediate reverse, the X-axis is oriented towards the start point of the part.
See Also
Reference
Tekla.Structures Namespace